In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.DataFrame([[2,np.nan,4],[np.nan,5,1],[5,6,7]])
data

     0    1  2
0  2.0  NaN  4
1  NaN  5.0  1
2  5.0  6.0  7

In [3]:
#查看缺失值情况
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      float64
 1   1       2 non-null      float64
 2   2       3 non-null      int64
dtypes: float64(2), int64(1)
memory usage: 200.0 bytes

#### 删除缺失值 dropna()

In [4]:
#默认情况下是一行为单位查看是否有缺失值，如果出现缺失值，那么就删除一整行
data

     0    1  2
0  2.0  NaN  4
1  NaN  5.0  1
2  5.0  6.0  7

In [5]:
data.dropna()#以行为标准删除axis=0

     0    1  2
2  5.0  6.0  7

In [6]:
#以列为标准删除  添加axis参数  axis=0(行)  axis=1(列)  或者指定columns参数
data.dropna(axis=1)#以列为标准删除

   2
0  4
1  1
2  7

In [7]:
data.dropna(axis="columns")#以列为标准删除

   2
0  4
1  1
2  7

In [8]:
#需求·1：当且仅当所有元素为nan的时候才删除某一行或者某一列 定义参数how=all(默认参数值=any)
data

     0    1  2
0  2.0  NaN  4
1  NaN  5.0  1
2  5.0  6.0  7

In [9]:
data.dropna(how="all")#由于并不存在全部为空的行所以不会删除

     0    1  2
0  2.0  NaN  4
1  NaN  5.0  1
2  5.0  6.0  7

In [10]:
#使用另外一组数据进行测试
data = pd.DataFrame([[2,np.nan,4],[np.nan,np.nan,1],[5,np.nan,7]])
data

     0   1  2
0  2.0 NaN  4
1  NaN NaN  1
2  5.0 NaN  7

In [11]:
#需求 删除第二列 1.要以列为单位 2.所有的元素都为nan的时候才删除
data.dropna(axis=1,how="all")#默认情况下axis=0 表示以行为单位进行操作

     0  2
0  2.0  4
1  NaN  1
2  5.0  7